var React = require('react');
var ReactDOM = require('react-dom');
var ReactDOMServer = require('react-dom/server');

var HowTo = React.createClass({

  componentDidMount: function () {
    var modalMarkup = (
      <div className="reveal text-center" id="how-to-modal" data-reveal="">
        <h3>วิธีการร่วมสนุก</h3>

        <ul className="number">
          <li>
            ลงทะเบียน หรือ ล็อคอินผ่าน Facebook
            <img src="../img/m-f-1.png" className="hide-for-large"></img>
            <img src="../img/d-f-1.png" className="show-for-large"></img>
          </li>
          <li>
            อัปโหลด #WhatsYourWhy เหตุผลที่ทำให้คุณ
           เริ่มต้นเปลี่ยนแปลงตัวคุณให้มีสุขภาพดี
           (รูป + ข้อความ)
            <img src="../img/m-f-2.png" className="hide-for-large"></img>
            <img src="../img/d-f-2.png" className="show-for-large"></img>
          </li>
          <li>
            แชร์ไปยังโซเชียลมีเดีย เพื่อลุ้น
            หมวกพร้อมลายเซ็น David Beckham
          </li>
          <li>
            #WhatsYourWhy ของคุณจะปรากฏบน
             Live Wall ร่วมกับเหตุผลของคนไทยอื่นๆ
             แบบเรียลไทม์
          </li>
        </ul>

        <h3>กิจกรรม #W<span className="text-small">hats</span>Y<span className="text-small">our</span>W<span className="text-small">hy</span> campaign</h3>

        <p><b>วิธีการร่วมสนุก</b></p>
        <p>เข้าร่วมกิจกรรมผ่านหน้าเว็บไซต์ www.campaigns.aia.co.th/WhatsYourWhy จากนั้นเลือกรูปภาพ และนำไป
โพสต์ลงบน Social Media</p>
        <ul>
          <li>หมวกพร้อมลายเซ็น David Beckham 1 รางวัล</li>
          <li>โทรศัพท์ Samsung Galaxy Note 8 มูลค่า 33,900 บาท 2 รางวัล</li>
          <li>นาฬิกา Garmin Vivofit 3 มูลค่า 4,190 บาท 30 รางวัล</li>
          <li>บัตรชมภาพยนตร์ เมเจอร์ซีนีเพล็กซ์ รางวัลละ 2 ใบ มูลค่า500 บาท 300 รางวัล</li>
          <li>ของที่ระลึกจาก AIA Vitality รางวัลละ 200 บาท 500 รางวัล</li>
        </ul>
        <p>และรางวัลอื่นๆ รวมกว่า 800 รางวัล รวมมูลค่ากว่า 500,000 บาท </p>
        <br/>
        <p><b>เกณฑ์การพิจารณา</b></p>
        <ul>
          <li>จับรายชื่อผู้โชคดีจากผู้เข้าร่วมกิจกรรม โดยผู้เข้าร่วมกิจกรรมต้องกรอกข้อมูล ลงทะเบียน และ อัพโหลดรูป พร้อมเหตุผลในการเริ่มต้นดูแลสุขภาพ ให้ครบถ้วน</li>
          <li>ผู้มีสิทธิ์รับรางวัลต้องคลิกยินยอมรับข่าวสารจาก เอไอเอ และยินดีให้ เอไอเอ ติดต่อกลับ เท่านั้นจึงจะได้รับสิทธิ์ดังกล่าว</li>
        </ul>
        <br/>
          <p><b>ระยะเวลาการร่วมสนุก</b></p>
          <ul>
            <li>วันศุกร์ที่15 กันยายน 2560 เวลา 9.00 น. – วันอาทิตย์ที่17 ธันวาคม 2560 เวลา 23.59 น.</li>
            </ul>
          <br/>
            <p><b>ประกาศผล</b></p>
            <p>วันพุธที่ 20 ธันวาคม 2560 บน Facebook Fanpage AIA Thailand - Official Site  โดยผู้โชคดีจะต้องยืนยันสิทธิ์การรับรางวัล ภายในวันจันทร์ที่ 25 ธันวาคม 2560 ก่อนเวลา 18.00 น.</p>
        <p>
          <b>หมายเหตุ :</b>
        </p>
        <ul>
          <li>จำกัดของรางวัลจำนวน 1 รางวัล ต่อผู้โชคดี 1 ท่าน ตลอดระยะเวลาการร่วมกิจกรรม โดยขอสงวนสิทธิ์ในการมอบรางวัลสูงสุดเพียง 1 รางวัลเท่านั้น</li>
          <li>สามารถเข้าร่วมกิจกรรมได้ไม่จำกัดจำนวนครั้ง ในระยะเวลาที่กำหนด</li>
          <li>ขอสงวนสิทธิ์ไม่พิจารณาและลบข้อความที่ใช้ภาษาหยาบคาย ส่อเสียด พาดพิง โดยไม่ต้องแจ้งให้ทราบล่วงหน้า</li>
          <li>ผู้โชคดีจะต้องยืนยันสิทธิ์ภายในวันจันทร์ที่ 25 ธันวาคม 2560 ก่อนเวลา 18.00 น. โดยส่งชื่อ-นามสกุล หมายเลขโทรศัพท์ และที่อยู่ มาที่ message (inbox) หากพ้นวันที่กำหนดแล้ว คณะกรรมการจะตัดสิทธิ์ทันทีโดยมิต้องแจ้งให้ทราบล่วงหน้า และให้ถือว่าผู้โชคดีที่มิได้มายืนยันสิทธิ์ภายในระยะเวลาที่กำหนดสละสิทธิ์การรับรางวัลโดยปริยาย</li>
          <li>หลังจากการยืนยันสิทธิ์แล้ว หากตรวจสอบพบว่ามีชื่อ-นามสกุลเดียวกันซ้ำกันมากกว่า 1 ชื่อ จะขอพิจารณาให้รางวัลสูงสุดเพียง 1 รางวัลเท่านั้น</li>
          <li>ผู้ได้รับรางวัลจะต้องชำระภาษีหัก ณ ที่จ่าย 5% จากมูลค่าของรางวัล หากรางวัลที่ได้รับมีมูลค่า ตั้งแต่ 1,000 บาทขึ้นไป</li>
          <li>ขอสงวนสิทธิ์พิจารณารางวัลให้แก่ผู้ร่วมกิจกรรมที่พักอาศัยอยู่ในประเทศไทยเท่านั้น</li>
          <li>ขอสงวนสิทธิ์ในการเปลี่ยนแปลงของรางวัล แก้ไข เพิ่มเติมเงื่อนไขในกติกาต่างๆ โดยไม่ต้องแจ้งให้ทราบล่วงหน้า และไม่สามารถเปลี่ยนของรางวัลเป็นเงินสดได้</li>
          <li>พนักงานและตัวแทนของ บริษัท เอไอเอ จำกัด ไม่มีสิทธิ์รับของรางวัลในกิจกรรมครั้งนี้</li>
          <li>ผู้ร่วมกิจกรรมไม่มีสิทธิ์เรียกร้องค่าตอบแทน ค่าเสียหาย หรือผลประโยชน์ใดๆ ไม่ว่าทางแพ่ง หรือทางอาญา</li>
          <li>ผู้ร่วมกิจกรรมยินยอมให้บริษัทฯ มีสิทธิ์ในการพิมพ์และ/หรือเผยแพร่รายชื่อ รูปถ่าย ของผู้ร่วมกิจกรรมเพื่อการโฆษณา และประชาสัมพันธ์ธุรกิจทั้งในปัจจุบันและ/หรือในอนาคต</li>
          <li>บริษัทฯ จะไม่รับผิดชอบใดๆ ต่อการสูญหาย หรือการถูกโจรกรรมข้อมูลของผู้ร่วมกิจกรรม ไม่ว่าจะเกิดจากสาเหตุใด</li>
          <li>การตัดสินของบริษัท เอไอเอ จำกัด ถือว่าเป็นที่สิ้นสุดในทุกกรณี</li>
        </ul>

        <button className="button-line" data-close="" >CLOSE</button>

        <button className="close-button" data-close="" aria-label="Close modal" type="button">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
    );

    var $modal = $(ReactDOMServer.renderToString(modalMarkup));
    $(ReactDOM.findDOMNode(this)).html($modal);

    var modal = new Foundation.Reveal($('#how-to-modal'));
    modal.open();
  },
  render: function () {
    return (<div></div>);
  }

});

module.exports = HowTo;
